app/controllers/computers_controller.rb

SELECT "computers".* FROM "computers"
---
  def index
    @computers = Computer.all

SELECT "computers".* FROM "computers"
---
  def view_all
    @computers = Computer.all

UPDATE "computers" SET "status" = ?, "updated_at" = ? WHERE "computers"."id" = ?  [["status", "t"], ["updated_at", "2017-06-28 18:53:59.146949"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @computer.update(computer_params)

SELECT  "computers".* FROM "computers" WHERE "computers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_computer
      @computer = Computer.find(params[:id])